Revit 2027 API
ExternalResourceBrowserData.FolderPath Property
 The current folder path to which the new resources and subfolder belong.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FolderPath { get; }
Public ReadOnly Property FolderPath As String
	Get
public:
property String^ FolderPath {
	String^ get ();
}
member FolderPath : string with get
Property Value
String
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace